#ifndef __MAIN__H_
#define __MAIN__H_

#include "globals.h"

extern int canal_buga;

// retirado do ficheiro  u-boot-1.1.x/include/pci_ids.h
#define PCI_VENDOR_ID_BROADCOM          0x14e4

#define SYSTEM_N_PORTS  18
#define SYSTEM_N_LAGS   SYSTEM_N_PORTS
#define SYSTEM_N_INTERF (SYSTEM_N_PORTS+SYSTEM_N_LAGS)
#define CLIENTS_MAX     (128*8)

#define CHMSG_RESET_ALARMS                                  0x200E      // Reset Alarms
#define CHMSG_RESET_DEFAULTS                                0x200F      // Reset defaults

#define CHMSG_IF_GPON_ONU_TEST_TRAFEGO_SWITCH               0x9999      // in st_HWGponOnu                                || out uin#define CHMSG_IF_GPON_ONU_TEST_TRAFEGO_SWITCH               0x9999      // in st_HWGponOnu                                || out uint
#define CHMSG_IF_GPON_ONU_TEST2_TRAFEGO_SWITCH              0x9998      // in st_HWGponOnu                                || out uin#define CHMSG_IF_GPON_ONU_TEST_TRAFEGO_SWITCH               0x9999      // in st_HWGponOnu                                || out uint
#define CHMSG_IF_GPON_ONU_TEST3_TRAFEGO_SWITCH              0x9997      // in st_HWGponOnu                                || out uin#define CHMSG_IF_GPON_ONU_TEST_TRAFEGO_SWITCH               0x9999      // in st_HWGponOnu                                || out uint

#define CHMSG_APPLICATION_IS_ALIVE                          0x9000
#define CHMSG_APPLICATION_RESOURCES                         0x9001

#define CHMSG_ETH_SNOOP_MODE                0x9501
#define CHMSG_ETH_SNOOP_INTF_MANGMT         0x9503
#define CHMSG_ETH_SNOOP_VLAN_MANGMT         0x9505
#define CHMSG_ETH_SNOOP_QUERIER_MANGMT      0x9507

#define CHMSG_ETH_GET_COUNTERS              0x9201   // in st_HWEthRFC2819Statistics
#define CHMSG_ETH_CLEAR_COUNTERS            0x9202   // in st_HWEthRFC2819Statistics
#define CHMSG_ETH_GET_VLAN_COUNTERS         0x9203   // in st_HWEth_FlowStatistics
#define CHMSG_ETH_GET_FLOW_COUNTERS_ABS     0x9204
#define CHMSG_ETH_GET_FLOW_COUNTERS_DIFF    0x9205
#define CHMSG_ETH_ADD_FLOW_COUNTERS         0x9206
#define CHMSG_ETH_REMOVE_FLOW_COUNTERS      0x9207

#define CHMSG_ETH_LACP_LAG_READ             0x9600
#define CHMSG_ETH_LACP_LAG_CREATE           0x9601
#define CHMSG_ETH_LACP_LAG_DESTROY          0x9602
#define CHMSG_ETH_LACP_LAG_STATUS           0x9603
#define CHMSG_ETH_LACP_ADMINSTATE_SET       0x9604
#define CHMSG_ETH_LACP_ADMINSTATE_GET       0x9605
#define CHMSG_ETH_LACP_STATS_SHOW           0x9610
#define CHMSG_ETH_LACP_STATS_CLEAR          0x9611

#define CHMSH_ETH_CHANGE_STDOUT             0x9300

#define CHMSG_ETH_NTW_CONNECTIVITY_SHOW     0x9F00
#define CHMSG_ETH_NTW_CONNECTIVITY          0x9F01
#define CHMSG_ETH_ROUTE_CONNECTIVITY        0x9F02

#define CCMSG_ETH_SWITCH_SET                0x9A00

#define GPON_LINK_MIN_NUM                 4
#define GPON_LINK_MAX_NUM                 8
#define GPON_DEVICE_MIN_NUM               1
#define GPON_DEVICE_MAX_NUM               2
#define GPON_LINK_PER_DEVICE              4
#define GPON_LINK_MAX_FLOWS               200
#define GPON_ONU_PER_LINK_MIN_NUM         64
#define GPON_ONU_PER_LINK_MAX_NUM         128
#define GPON_US_BW_MAX                    1000 // teoricamente este numero  igual ao numero de t-conts por onu
#define GPON_US_BW_PER_ONU                10 // teoricamente este numero  igual ao numero de t-conts por onu
#define GPON_PROFILE_MAX_NUM              50
#define GPON_PROFILE_TYPE_MAX_NUM         10
#define GPON_ONU_CARDHOLDER_MAX_NUM       10
#define GPON_ONU_TCONT_MAX_NUM            20  // limite teorico256
#define GPON_ONU_GEMPORT_MAX_NUM          4095
#define GPON_ONU_GEMPORT_OFFSET           254
#define GPON_ONU_GEMPORT_INTERVAL_ONU     30
#define GPON_ONU_ALLOCID_OFFSET           1000
#define GPON_ONU_ANIG_MAX_NUM             16
#define GPON_SLOT_PER_ONU_MIN_NUM         1
#define GPON_SLOT_PER_ONU_MAX_NUM         2
#define GPON_ONU_PQUEUE_MAX_NUM           256   // limite pratico = GPON_ONU_TCONT_MAX_NUM  ||   limite teorico 0x0000 a 0xffff 65535-0+1=65536 
#define GPON_ONU_PQUEUE_MAX_INDEX_NUM     65536 // limite teorico 0x0000 a 0xffff 65535-0+1=65536 
#define GPON_ONU_MAX_ETHERNET_PORTS       8

#define GPON_SFP_NUM                      16
#define GPON_XFP_NUM                      2
#define GPON_SFP_XFP_NUM                  ((GPON_SFP_NUM)+(GPON_XFP_NUM))

#define CE_VENDOR_ID_FIELD_SIZE       ( 4 )
#define CE_VENDOR_SPECIFIC_FIELD_SIZE ( 4 )


/* Switch general configuration */
typedef struct {
  int32  err_code;                   /* unused in commands (only in responses */
  uint32 mask;                       /* Mask (32 bits for alignment purposes)
                                            0x01 - Aging Time  */
  int32  aging_time;                 /* Forwarding Database Aging Interval
                                           (10-1000000 */
} __attribute__((packed)) L7_switch_config;

typedef struct _st_HWEthPhyState_Block {
  uint16 Mask;
  uint8  Speed;              // 0x0001  0 - AutoNeg;  1 - 10;    2 - 100; 3 - 1000
  uint8  Duplex;             // 0x0002  0 - Half;     1 - Full
  uint8  Collisions;         // 0x0004  0 - OK;   1 - NOK
  uint8  RxActivity;         // 0x0008  0 - Sem;  1 - Com
  uint8  TxActivity;         // 0x0010  0 - Sem;  1 - Com
  uint8  LinkUp;             // 0x0020  0 - Down; 1 - Up
  uint8  AutoNegComplete;    // 0x0040  0 - incompleted; 1 - completed
  uint8  TxFault;            // 0x0080  0 - ok;   1 - Tx_fault
  uint8  RemoteFault;        // 0x0100  0 - ok;   1 - remote_fault recebido
  uint8  LOS;                // 0x0200  0 - s/ LOS; 1 - em LOS
  uint8  Media;              // 0x0400  0 - electric; 1 - optic
  uint8  MTU_mismatch;       // 0x0800  0 - MTU suported; 1 - MTU not suported
  uint16 Suported_MaxFrame;// 0x1000  1518 to 9600
} __attribute__((packed)) st_HWEthPhyState_Block;

typedef struct _st_HWEthPhyState
{
  uint8  Port;
  st_HWEthPhyState_Block HWEthPhyState_Block;
} __attribute__((packed)) st_HWEthPhyState;


typedef struct _st_HWEthPhyConf_Block {
  uint16  Mask;
  uint8   Speed;              // 0x0001   0 - AutoNeg;  1 - 10;      2 - 100;       3 ? 1000;  4 ? 2500; 5 - 10000
  uint8   Media;              // 0x0002   0 - electric; 1 - optic;   2 - Serdes
  uint8   Duplex;             // 0x0004   0 - Half;     1 - Full
  uint8   LoopBack;           // 0x0008   0 - s/ loop;  1 - Far End; 2 - swap loop; 3 - local oam loop; 4 - remote oam loop
  uint8   FlowControl;        // 0x0010   0 - Off;      1 - Tx;      2 - Rx;        3 - Both
  uint8   PortEnable;         // 0x0020   0 - disabled; 1 - enabled
  uint16  MaxFrame;           // 0x0040
  uint8   VlanAwareness;      // 0x0080   0 - unaware;  1 - aware
  uint8   MacLearning;        // 0x0100   0 - don't learn; 1 - learn
  uint8   AutoMDI;            // 0x0200   0 - disable;     1 - enable
} __attribute__((packed)) st_HWEthPhyConf_Block; // st_MC_Man_PhyConf

// Switch Port PHY configurations
typedef struct _st_HWEthPhyConf {
  uint8   Port;               // 0-7:Pon; 8-15:1/2.5G Eth; 16-17:10G Eth
  st_HWEthPhyConf_Block HWEthPhyConf_Block;
} __attribute__((packed)) st_HWEthPhyConf; // st_MC_Man_PhyConf

// Switch port type definition (MEF)
typedef struct _st_HWVlanDefs {
  uint8   Port;
  uint8   Mask;
  uint16  defVid;                    // 0x01
  uint8   defPrio;                   // 0x02    
  uint8   acceptable_frame_types;    // 0x04
  uint8   ingress_filter;            // 0x08
  uint8   restricted_vlan_reg;       // 0x10
  uint8   vlan_aware;                // 0x20
  uint8   type;                      // 0x40   UNI=1, NNI=2
} __attribute__((packed)) st_HWVlanDefs;




#define MEF10_EVC_UNITYPE_ROOT    0
#define MEF10_EVC_UNITYPE_LEAF    1
#define MEF10_EVC_UNITYPE_UNUSED ((uint8) -1)

//T_EVC_CEVID_MAP
typedef struct {
  uint8    type;       // enum{0 - root, 1 - leaf, -1 - unused}
  uint16   ceVid;      // gamma[1, .., 4094]
} __attribute__((packed)) st_HwEthernetMef10CeVidMap;

typedef struct {
  int err_code;               /*unused in commands (only responses)*/
  uint64 index;                  //index: 0..N_MACs-1
} __attribute__((packed)) MSG_GENERIC_PREFIX_STRUCT;

// Definição de um EVC
typedef struct {
  int err_code;                 /*unused in commands (only responses)*/
  uint64 index;                 //index: 0..N_MACs-1
  uint8                         type;                      // { 0 - p2p, 1 - mp2mp, 2 - rooted mp, 3 - remover }
  uint8                         admin;                     // { 0 - criar, 1 - modificar, 2 - Flush }
  uint8                         bundling;                  // false:true(0:1)
  uint16                        outerTag;                  // gamma [1, .., 4094]
  uint8                         ceVidBitmap[1 << (12-3)];  // mapa de bits para vlans, o acesso a vlan x e feito por ((bitmap[x/8] >> x%8) & 0x01)
  st_HwEthernetMef10CeVidMap    uni[SYSTEM_N_PORTS];       // mapa de pares portos/vlan (vlan apenas interessa quando nao existe bundling)
} __attribute__((packed)) MSG_HwEthernetMef10EvcBundling;

// Definição de um perfil de largura de banda
typedef struct {
  int err_code;               /*unused in commands (only responses)*/
  uint64 index;               //index: bits 63-48:evc_id; 47-32:c_vid; 31-16:s_vid; 15-8:CoS; 7:rx1_tx0; 6:no_profile; 5-0:port;
  uint8                       colourMode;
  uint8                       couplingFlag;
  uint64                      CIR;
  uint64                      CBS;
  uint64                      EIR;
  uint64                      EBS;
} __attribute__((packed)) MSG_HwEthernetProfile;

// DHCP Op82: Set Access Node Identifier
typedef struct {
  int   err_code;             //unused in commands (only responses)
  char  access_node_id[41];
} __attribute__ ((packed)) st_HwEthernetAccessNodeId;

// Definição de um perfil de largura de banda
typedef struct {
  int err_code;               //unused in commands (only responses)
  uint64 index;            //index: bits 63-48:evc_id; 47-32:c_vid; 31-16:s_vid; 15-8:CoS; 7:rx1_tx0; 6:no_profile; 5-0:port;
  char circuitId[64];
  char remoteId[64];
} __attribute__((packed)) st_HwEthernetDhcpOpt82Profile;

// Activação de um EVC
typedef struct {
  int err_code;               /*unused in commands (only responses)*/
  uint64 index;                  //index: 0..N_MACs-1
  uint8                      admin;                     // { 0 - inactivo, 1 - activo }
} __attribute__((packed)) MSG_HwEthernetMef10p1EvcAdmin;

// Remoção de um EVC
typedef struct {
  int err_code;               /*unused in commands (only responses)*/
  uint64 index;                  //index: 0..N_MACs-1
} __attribute__((packed)) MSG_HwEthernetMef10p1EvcRemove;

typedef struct {
  uint16                pvid;       //1-4094    Port VLAN identifier for port-based VLAN
  //not used in our implementation: the VID set for port-and-protocol based VLAN classification (max_entries and the entries, where each entry is a pair VID,PROTOCOL_TEMPLATE_ID)
  uint8    acceptable_frame_types;
  uint8                 ingress_filter;     //accept only frames from VLANs members of this port
  uint8                 restricted_VLAN_reg;
} __attribute__((packed)) _802_1Q_VLAN_MAN_PORT;

// Estruturas de contadores
typedef struct _st_HWEthRFC2819_Statistics_Block
{
  unsigned long long etherStatsDropEvents;               // 0x00000001
  unsigned long long etherStatsOctets;                   // 0x00000002
  unsigned long long etherStatsPkts;                     // 0x00000004
  unsigned long long etherStatsBroadcastPkts;            // 0x00000008
  unsigned long long etherStatsMulticastPkts;            // 0x00000010
  unsigned long long etherStatsCRCAlignErrors;           // 0x00000020
  unsigned long long etherStatsUndersizePkts;            // 0x00000040
  unsigned long long etherStatsOversizePkts;             // 0x00000080
  unsigned long long etherStatsFragments;                // 0x00000100
  unsigned long long etherStatsJabbers;                  // 0x00000200
  unsigned long long etherStatsCollisions;               // 0x00000400
  unsigned long long etherStatsPkts64Octets;             // 0x00000800
  unsigned long long etherStatsPkts65to127Octets;        // 0x00001000
  unsigned long long etherStatsPkts128to255Octets;       // 0x00002000
  unsigned long long etherStatsPkts256to511Octets;       // 0x00004000
  unsigned long long etherStatsPkts512to1023Octets;      // 0x00008000
  unsigned long long etherStatsPkts1024to1518Octets;     // 0x00010000
  unsigned long long etherStatsPkts1519toMaxOctets;      // Proprietary
  unsigned long long Throughput;
} __attribute__((packed)) st_HWEthRFC2819_Statistics_Block; //144

typedef struct _st_HWEthRFC2819_PortStatistics_Block
{
  uint32  RxMask;
  uint32  TxMask;
  st_HWEthRFC2819_Statistics_Block Rx;      // 0x01
  st_HWEthRFC2819_Statistics_Block Tx;      // 0x02
} __attribute__((packed)) st_HWEthRFC2819_PortStatistics_Block; //296

typedef struct _st_HWEthRFC2819Statistics {
  // BYTE Slot;      Não necessário
  // BYTE OutPort;   Não necessário
  // BYTE Inventory; Não necessário
  uint8 Port;
  uint8 Mask;
  st_HWEthRFC2819_PortStatistics_Block PortStatistics;     
} __attribute__((packed)) st_HWEthRFC2819Statistics;

typedef struct _st_HWEth_VlanStatistics_Block
{
  uint64 etherNotRedPackets;
  uint64 etherRedPackets;
} __attribute__((packed)) st_HWEth_VlanStatistics_Block;

typedef struct _st_HWEth_VlanStat
{
  uint16 CVid;
  st_HWEth_VlanStatistics_Block stat;
} __attribute__((packed)) st_HWEth_VlanStat; //296

typedef struct _st_HWEth_VlanStatistics
{
  uint16  FlowId;
  uint16  SVid;
  st_HWEth_VlanStat stat;
} __attribute__((packed)) st_HWEth_VlanStatistics; //296

typedef struct _st_DHCP_Statistics_t
{
  uint64 dhcp_rx_intercepted;
  uint64 dhcp_rx;
  uint64 dhcp_rx_filtered;
